code-review/NRB_3471_3546/База_Было/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/CommonModules/Конвертации/Ext/Module.bsl
Функция СтрокаВДату(Элемент, ФорматСтроки, РазделительДаты, знач ПрефиксГодаДаты=0) Экспорт
	Перем СтруктураДаты;
	Попытка
		Выполнить("СтруктураДаты = Новый Структура("""+ФорматСтроки+""","+?(РазделительДаты<>",",СтрЗаменить(Элемент,РазделительДаты,","),Элемент)+")");
	Исключение
		Возврат "Недопустимый формат даты";
	КонецПопытки;
	Возврат Дата(ПрефиксГодаДаты*100+СтруктураДаты.Год,СтруктураДаты.Месяц,СтруктураДаты.День);
КонецФункции

// из строки с разделителями таб возвращается структура для заполнения
Процедура СтрокаВТаблицуЗначений(СтрокаТаблицыЗначений, СписокПолейСтроки, СписокЗначенийСтроки) Экспорт
	Перем СтруктураПолей;
	СписокЗначенийСтроки = СтрЗаменить(СписокЗначенийСтроки,"""","''");
	Попытка
		Выполнить("СтруктураПолей = Новый Структура("""+СтрЗаменить(СписокПолейСтроки,Символы.Таб,",")+""","""+СтрЗаменить(СписокЗначенийСтроки,Символы.Таб,""",""")+""")");
	Исключение
		Сообщить("Недопустимый формат данных");
	КонецПопытки;
	ЗаполнитьЗначенияСвойств(СтрокаТаблицыЗначений,СтруктураПолей);
КонецПроцедуры

Функция КонвертацияВалюты(Дата, Сумма, Валюта, Знач НужнаВалюта = Истина) Экспорт
	Перем ПараметрыВалюты;
	ПараметрыВалюты = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта",Валюта));
	Если ПараметрыВалюты.Курс = Неопределено Тогда
		Сообщить("На дату "+Дата+" для валюты "+Валюта+" не определен курс");
		Возврат Неопределено;
	КонецЕсли;
	Если ПараметрыВалюты.Кратность = Неопределено Тогда
		Сообщить("На дату "+Дата+" для валюты "+Валюта+" не определена кратность");
		Возврат Неопределено;
	КонецЕсли;
	Возврат ?(НужнаВалюта, Сумма / ПараметрыВалюты.Курс * ПараметрыВалюты.Кратность, Сумма / ПараметрыВалюты.Кратность * ПараметрыВалюты.Курс);
КонецФункции
